/*
 *    메소드
 *      => 지역변수, 매개변수 => 메소드가 종료되면 자동으로 사라진다
 *      => 사라지지 않는 지역변수 
 *      클래스 영역에 변수를 선언하는 변수들은 종료할때까지 사라지지 않는다
 *    이런것들을 
 *    "멤버변수" 라고 한다
 *    
 *    매개변수들을 맴버변수로 박아버리면 코딩하기가 더 쉽나?
 *    
 *    변수를 맴버, 공유변수로 쓰면 return이 필요 없이 void로 해결할 수 있다.
 *    맴버변수 , 공유변수 => 클래스 전체에서 사용
 *    지역변수 : 메소드 안에서 사용 => 리턴형
 *    매개변수 : 메소드 안에서만 사용
 *      
 */
public class 메소드정리_06 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
