/*
 * 	1. 변수 선언 (25page)
 * 		1) 변수 : 한개의 데이터를 저장하는 메모리 공간 이름
 * 									------- 주소로 되어있음
 * 				=>데이터 변경이 가능
 * 		2) 상수 : 한개의 데이터를 저장하는 메모리 공간 이름
 * 				=> 데이터 변경이 불가능
 * 				=> 변수와 상수의 구분은 final
 * 				   ----  ---> final 데이터형 상수명=값(고정) *변경 불가
 * 				    |
 * 				데이터형 변수명 = 값 *변경 가능
 * 		3) 리터럴 : 실제 저장된 값(메모리)
 *  2. 변수 명칭법 (26page) => 식별자 => 같은 곳에서 같은 이름의 변수는 사용이 불가능하다
 *  	=> 알파벳 , 한글로 시작  
 *  	 대소문자 구분
 *  	 int 국어, 영어, 수학
 *  	 int Kor, kor, eng, math
 *  	=> 숫자사용 가능하지만 맨 앞에는 사용할 수 없다.
 *  	 int kor1, kor2, kor3 ...
 *  	=> 키워드는 사용할 수 없다
 *  	 int, byte, long , char , boolean ...
 *  	=> 공백이 들어갈 수 없다
 *  	 int a b = 1;  << 오류
 *  	=> 특수문자 사용이 가능 
 *  	 _ , $  -> 위치는 상관 없다
 *  	 _가 앞에 있는 경우는 임시변수 -> _temp => 정렬 할때 주로사용
 *  	=> 클래스, 변수, 상수, 메소드, 인터페이스, 추상클래스, 배열 ...;
 *  
 *  3. 데이터형 (타입), 기본형 (30page)
 * 	   형식)
 * 		데이터타입 변수명;
 * 		------정수, 실수, 문자, 논리
 * 		--------------------------------
 *		정수형 :  byte
 *				short
 *				int
 *				long
 * 		--------------------------------
 * 		논리형 : boolean
 * 		--------------------------------
 * 		문자형 : char
 * 		--------------------------------
 *		실수형 :  float
 *				double
 * 		--------------------------------
 * 		참조형 : 데이터를 여러개 한번에 저장하는 방법
 * 				배열/클래스
 * 		--------------------------------
 *  4. 각 데이터형별 사용법 
 *  5. 연산처리 => 제어
 */
public class 변수_2 {
	
	public static void main(String[] args) {
		
		
	
	}
}
