/*
 *  1. 사용자로부터 아이디를 받아서 중복체크하는 메소드 원형을 작성하시오
 *
 *	2. 우편번호를 검색하는 메소드 원형을 작성하시오
 *
 *	3. 2단에서 9단까지 구구단을 출력하는 메소드 원형을 작성하시오
 * 
 *  원형만 작성한다는 것은 리턴형과 매개변수만 찾는다는 것이다.
 *  구현 까지 할 필요는 없다.
 * 
 */
public class 메서드문제_2 {
//	1. 사용자로부터 아이디를 받아서 중복체크하는 메소드 원형을 작성하시오
//     	boolean idCheck(String id)
//	2. 우편번호를 검색하는 메소드 원형을 작성하시오
//	    String[] postFind(String dong)
//	3. 2단에서 9단까지 구구단을 출력하는 메소드 원형을 작성하시오
//      void gugu()
	public static void main(String[] args) {
      
		

	}

}
