/*
 * 	25p
 * 		변수 / 상수
 *  26p
 *  	1) 형식
 *  	2) 식별자
 *  28p
 *  	1) 변수 초기화
 *  30p
 *  	1)데이터형
 *  	-----------암기
 *  	=> 변수, 식별자, 데이터형, 변수초기화
 *  
 *  사용자 요청 처리
 *  38p => 산술연산자
 *  41p => 복합대입연산자, 증감연산자
 *  44p => 비교연산자
 *  45p => 논리연산자
 *  48p => 조건연산자
 *  50~51p => 형변환
 *  ----------------------프로그램 : 변수설정, 연산자, 제어문
 *  변수 => 응용 => 연산자
 *  연산자 => 응용 => 제어문
 *  제어문 => 응용 => 메서드
 *  메서드 => 응용 => 클래스
 *  
 */
public class 교재_정리 {

	public static void main(String[] args) {
		
		
	}
}
